Sub-IoT/Sub-IoT-Stack/stack/framework/hal/chips/ezr32lg/emlib/inc/em_opamp.h
/** OPAMP init structure. */
typedef struct
{
  OPAMP_NegSel_TypeDef   negSel;              /**< Select input source for negative terminal.    */
  OPAMP_PosSel_TypeDef   posSel;              /**< Select input source for positive terminal.    */
  OPAMP_OutMode_TypeDef  outMode;             /**< Output terminal connection.                   */
  OPAMP_ResSel_TypeDef   resSel;              /**< Select R2/R1 resistor ratio.                  */
  OPAMP_ResInMux_TypeDef resInMux;            /**< Select input source for resistor ladder.      */
  uint32_t               outPen;              /**< Alternate output enable bit mask. This value
                                                 should consist of one or more of the
                                                 DAC_OPA[opa#]MUX_OUTPEN_OUT[output#] flags
                                                 (defined in \<part_name\>_dac.h) OR'ed together.
                                                 @n @n
                                                 For OPA0:
                                                 @li DAC_OPA0MUX_OUTPEN_OUT0
                                                 @li DAC_OPA0MUX_OUTPEN_OUT1
                                                 @li DAC_OPA0MUX_OUTPEN_OUT2
                                                 @li DAC_OPA0MUX_OUTPEN_OUT3
                                                 @li DAC_OPA0MUX_OUTPEN_OUT4

                                                 For OPA1:
                                                 @li DAC_OPA1MUX_OUTPEN_OUT0
                                                 @li DAC_OPA1MUX_OUTPEN_OUT1
                                                 @li DAC_OPA1MUX_OUTPEN_OUT2
                                                 @li DAC_OPA1MUX_OUTPEN_OUT3
                                                 @li DAC_OPA1MUX_OUTPEN_OUT4

                                                 For OPA2:
                                                 @li DAC_OPA2MUX_OUTPEN_OUT0
                                                 @li DAC_OPA2MUX_OUTPEN_OUT1

                                                 E.g: @n
                                                 init.outPen = DAC_OPA0MUX_OUTPEN_OUT0 |
                                                 DAC_OPA0MUX_OUTPEN_OUT2 |
                                                 DAC_OPA0MUX_OUTPEN_OUT4;                        */
  uint32_t               bias;                /**< Set OPAMP bias current.                       */
  bool                   halfBias;            /**< Divide OPAMP bias current by 2.               */
  bool                   lpfPosPadDisable;    /**< Disable low pass filter on positive pad.      */
  bool                   lpfNegPadDisable;    /**< Disable low pass filter on negative pad.      */
  bool                   nextOut;             /**< Enable NEXTOUT signal source.                 */
  bool                   npEn;                /**< Enable positive pad.                          */
  bool                   ppEn;                /**< Enable negative pad.                          */
  bool                   shortInputs;         /**< Short OPAMP input terminals.                  */
  bool                   hcmDisable;          /**< Disable input rail-to-rail capability.        */
  bool                   defaultOffset;       /**< Use factory calibrated opamp offset value.    */
  uint32_t               offset;              /**< Opamp offset value when @ref defaultOffset is false.*/
} OPAMP_Init_TypeDef;

/** Configuration of OPA0/1 in unity gain voltage follower mode. */
#define OPA_INIT_UNITY_GAIN                                                     \
{                                                                               \
  opaNegSelUnityGain,             /* Unity gain.                             */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelDefault,               /* Resistor ladder is not used.            */ \
  opaResInMuxDisable,             /* Resistor ladder disabled.               */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  false,                          /* Neg pad disabled.                       */ \
  true,                           /* Pos pad enabled, used as signal input.  */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA2 in unity gain voltage follower mode. */
#define OPA_INIT_UNITY_GAIN_OPA2                                                \
{                                                                               \
  opaNegSelUnityGain,             /* Unity gain.                             */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelDefault,               /* Resistor ladder is not used.            */ \
  opaResInMuxDisable,             /* Resistor ladder disabled.               */ \
  DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  false,                          /* Neg pad disabled.                       */ \
  true,                           /* Pos pad enabled, used as signal input.  */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA0/1 in non-inverting amplifier mode.           */
#define OPA_INIT_NON_INVERTING                                                  \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  true,                           /* Neg pad enabled, used as signal ground. */ \
  true,                           /* Pos pad enabled, used as signal input.  */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA2 in non-inverting amplifier mode. */
#define OPA_INIT_NON_INVERTING_OPA2                                             \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  true,                           /* Neg pad enabled, used as signal ground. */ \
  true,                           /* Pos pad enabled, used as signal input.  */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA0/1 in inverting amplifier mode. */
#define OPA_INIT_INVERTING                                                      \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelR2eqR1,                /* R2 = R1                                 */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  true,                           /* Neg pad enabled, used as signal input.  */ \
  true,                           /* Pos pad enabled, used as signal ground. */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA2 in inverting amplifier mode. */
#define OPA_INIT_INVERTING_OPA2                                                 \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelR2eqR1,                /* R2 = R1                                 */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  true,                           /* Neg pad enabled, used as signal input.  */ \
  true,                           /* Pos pad enabled, used as signal ground. */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA0 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA0                                    \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeAll,                  /* Both main and alternate outputs.        */ \
  opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  true,                           /* Pass output to next stage (OPA1).       */ \
  true,                           /* Neg pad enabled, used as signal ground. */ \
  true,                           /* Pos pad enabled, used as signal input.  */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA1 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA1                                    \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelOpaIn,                 /* Pos input from OPA0 output.             */ \
  opaOutModeAll,                  /* Both main and alternate outputs.        */ \
  opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  true,                           /* Pass output to next stage (OPA2).       */ \
  true,                           /* Neg pad enabled, used as signal ground. */ \
  false,                          /* Pos pad disabled.                       */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA2 in cascaded non-inverting amplifier mode. */
#define OPA_INIT_CASCADED_NON_INVERTING_OPA2                                    \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelOpaIn,                 /* Pos input from OPA1 output.             */ \
  opaOutModeMain,                 /* Main output enabled.                    */ \
  opaResSelR2eq0_33R1,            /* R2 = 1/3 R1                             */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  DAC_OPA0MUX_OUTPEN_OUT0,        /* Alternate output 0 enabled.             */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  false,                          /* No nextout output enabled.              */ \
  true,                           /* Neg pad enabled, used as signal ground. */ \
  false,                          /* Pos pad disabled.                       */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

/** Configuration of OPA0 in cascaded inverting amplifier mode. */
#define OPA_INIT_CASCADED_INVERTING_OPA0                                        \
{                                                                               \
  opaNegSelResTap,                /* Neg input from resistor ladder tap.     */ \
  opaPosSelPosPad,                /* Pos input from pad.                     */ \
  opaOutModeAll,                  /* Both main and alternate outputs.        */ \
  opaResSelR2eqR1,                /* R2 = R1                                 */ \
  opaResInMuxNegPad,              /* Resistor ladder input from neg pad.     */ \
  0,                              /* No alternate outputs enabled.           */ \
  _DAC_BIASPROG_BIASPROG_DEFAULT, /* Default bias setting.                   */ \
  _DAC_BIASPROG_HALFBIAS_DEFAULT, /* Default half-bias setting.              */ \
  false,                          /* No low pass filter on pos pad.          */ \
  false,                          /* No low pass filter on neg pad.          */ \
  true,                           /* Pass output to next stage (OPA1).       */ \
  true,                           /* Neg pad enabled, used as signal input.  */ \
  true,                           /* Pos pad enabled, used as signal ground. */ \
  false,                          /* No shorting of inputs.                  */ \
  false,                          /* Rail-to-rail input enabled.             */ \
  true,                           /* Use factory calibrated opamp offset.    */ \
  0                               /* Opamp offset value (not used).          */ \
}

